; domain
;; Q1 - agri-energy domain (discrete numeric PDDL)
;; one mobile robot, four plots, one dock. battery is a numeric fluent.

(define (domain agri-energy)

  (:requirements :strips :typing :numeric-fluents)

  (:types robot location)


  ;; ------- predicates -------

  (:predicates
    ;; robot position. note: "robot-at" instead of "at",
    ;; because ENHSP reserves "at" as a temporal keyword.
    (robot-at ?r - robot ?l - location)

    ;; graph edges (we list both directions in the problem file)
    (connected ?l1 ?l2 - location)

    ;; flag marking the docking station(s)
    (is-dock ?l - location)

    ;; completion flags - true after each operation has been performed
    (monitored ?l - location)
    (watered ?l - location)
    (fertilized ?l - location)
    (harvested ?l - location)

    ;; requirement flags - which plot needs which operation.
    ;; set in the problem's :init, consumed by the action effect.
    (needs-monitor ?l - location)
    (needs-water ?l - location)
    (needs-fertilize ?l - location)
    (needs-harvest ?l - location)
  )


  ;; ------- numeric fluents -------

  (:functions
    ;; per-robot energy state
    (battery ?r - robot)
    (capacity ?r - robot)
    (load ?r - robot)
    ;; per-edge move cost (set in the problem file, encodes terrain)
    (move-cost ?from ?to - location)

    ;; per-operation costs (nullary functions, set as constants in the problem file)
    (op-cost-monitor)
    (op-cost-water)
    (op-cost-fertilize)
    (op-cost-harvest)
  )


  ;; ------- actions -------

  ;; move along a connected edge if there is enough battery.
  ;; spends the edge's move-cost.
  (:action move
    :parameters (?r - robot ?from ?to - location)
    :precondition (and
      (robot-at ?r ?from)
      (connected ?from ?to)
      ;; Energy needed is move-cost + current load penalty
      (>= (battery ?r) (+ (move-cost ?from ?to) (load ?r)))
    )
    :effect (and
      (not (robot-at ?r ?from))
      (robot-at ?r ?to)
      (decrease (battery ?r) (+ (move-cost ?from ?to) (load ?r)))
    )
  )

  ;; the four operations below share the same shape:
  ;;   require robot-at, the matching needs-X flag, and enough battery;
  ;;   set the completion flag, drop the needs flag, decrease battery.
  ;; only the names and costs differ.

  (:action monitor
    :parameters (?r - robot ?l - location)
    :precondition (and
      (robot-at ?r ?l)
      (needs-monitor ?l)
      (>= (battery ?r) (op-cost-monitor))
    )
    :effect (and
      (monitored ?l)
      (not (needs-monitor ?l))
      (decrease (battery ?r) (op-cost-monitor))
    )
  )

  (:action water
    :parameters (?r - robot ?l - location)
    :precondition (and
      (robot-at ?r ?l)
      (needs-water ?l)
      (>= (battery ?r) (op-cost-water))
    )
    :effect (and
      (watered ?l)
      (not (needs-water ?l))
      (decrease (battery ?r) (op-cost-water))
      (decrease (load ?r) 5) ;;  Robot becomes lighter after watering
    )
  )

  (:action fertilize
    :parameters (?r - robot ?l - location)
    :precondition (and
      (robot-at ?r ?l)
      (needs-fertilize ?l)
      (>= (battery ?r) (op-cost-fertilize))
    )
    :effect (and
      (fertilized ?l)
      (not (needs-fertilize ?l))
      (decrease (battery ?r) (op-cost-fertilize))
      (decrease (load ?r) 5) ;; Robot becomes lighter after fertilizing
    )
  )

  (:action harvest
    :parameters (?r - robot ?l - location)
    :precondition (and
      (robot-at ?r ?l)
      (needs-harvest ?l)
      (>= (battery ?r) (op-cost-harvest))
    )
    :effect (and
      (harvested ?l)
      (not (needs-harvest ?l))
      (decrease (battery ?r) (op-cost-harvest))
      (increase (load ?r) 5) ;; Robot becomes heavier after harvesting
    )
  )

  ;; recharge - only valid at the dock. resets battery to capacity
  ;; in a single discrete jump (Q1 behaviour; Q2 will use a continuous process).
  (:action recharge
    :parameters (?r - robot ?l - location)
    :precondition (and
      (robot-at ?r ?l)
      (is-dock ?l)
    )
    :effect (and
      (assign (battery ?r) (capacity ?r))
    )
  )
)

; problem
(define (problem Q1_problem2)
  (:domain agri-energy)

  (:objects
    r1 - robot
    D P1 P2 P3 P4 - location
  )

  (:init
    (robot-at r1 D)
    (is-dock D)
    
    (needs-fertilize P3)
    (needs-harvest P4)

    (connected D P1)  (connected P1 D)
    (connected D P2)  (connected P2 D)
    (connected P1 P3) (connected P3 P1)
    (connected P2 P4) (connected P4 P2)
    (connected P3 P4) (connected P4 P3)

   ;; Initial numerical values
    (= (battery r1) 100)
    (= (capacity r1) 100)
    (= (load r1) 5) ;;

    (= (move-cost D P1) 10)  (= (move-cost P1 D) 10)
    (= (move-cost D P2) 10)  (= (move-cost P2 D) 10)
    (= (move-cost P1 P3) 20) (= (move-cost P3 P1) 20)
    (= (move-cost P2 P4) 20) (= (move-cost P4 P2) 20)
    (= (move-cost P3 P4) 30) (= (move-cost P4 P3) 30)

    (= (op-cost-monitor) 5)
    (= (op-cost-water) 15)
    (= (op-cost-fertilize) 20)
    (= (op-cost-harvest) 25)
  )

  (:goal (and
    
    (fertilized P3)
    (harvested P4)
    (robot-at r1 D)
  ))
)

; plan
1. (move r1 d p1)
   deleted: (robot-at r1 d)
   added: (robot-at r1 p1)
   changed: (battery r1) from 100 to 85
   goals met: 0 of 3
2. (move r1 p1 p3)
   deleted: (robot-at r1 p1)
   added: (robot-at r1 p3)
   changed: (battery r1) from 85 to 60
   goals met: 0 of 3
3. (fertilize r1 p3)
   deleted: (needs-fertilize p3)
   added: (fertilized p3)
   changed: (battery r1) from 60 to 40, (load r1) from 5 to 0
   goals met: 1 of 3
4. (move r1 p3 p1)
   deleted: (robot-at r1 p3)
   added: (robot-at r1 p1)
   changed: (battery r1) from 40 to 20
   goals met: 1 of 3
5. (move r1 p1 d)
   deleted: (robot-at r1 p1)
   added: (robot-at r1 d)
   changed: (battery r1) from 20 to 10
   goals met: 2 of 3
6. (recharge r1 d)
   changed: (battery r1) from 10 to 100
   goals met: 2 of 3
7. (move r1 d p2)
   deleted: (robot-at r1 d)
   added: (robot-at r1 p2)
   changed: (battery r1) from 100 to 90
   goals met: 1 of 3
8. (move r1 p2 p4)
   deleted: (robot-at r1 p2)
   added: (robot-at r1 p4)
   changed: (battery r1) from 90 to 70
   goals met: 1 of 3
9. (harvest r1 p4)
   deleted: (needs-harvest p4)
   added: (harvested p4)
   changed: (battery r1) from 70 to 45, (load r1) from 0 to 5
   goals met: 2 of 3
10. (move r1 p4 p2)
   deleted: (robot-at r1 p4)
   added: (robot-at r1 p2)
   changed: (battery r1) from 45 to 20
   goals met: 2 of 3
11. (move r1 p2 d)
   deleted: (robot-at r1 p2)
   added: (robot-at r1 d)
   changed: (battery r1) from 20 to 5
   goals met: 3 of 3
